carlosperate/ArduinoCore-microbit/boards.txt
####################
# BBC micro:bit V2 #
####################
microbit_v2.name=BBC micro:bit V2

microbit_v2.vid.0=0x0d28
microbit_v2.pid.0=0x0204

microbit_v2.build.mcu=cortex-m4
# FPU flags not used for compilation (CODAL CMake owns those), but arduino-cli reads
# these to pick a "precompiled" library's archive subfolder, e.g. src/cortex-m4/fpv4-sp-d16-softfp/.
# Its fallback of scanning recipe.cpp.o.pattern for -mfpu=/-mfloat-abi= can't find anything
# as this core doesn't configure it.
# The fpu and float-abi values must match cpu_opts in CODAL's target-locked.json.
microbit_v2.build.fpu=fpv4-sp-d16
microbit_v2.build.float-abi=softfp
microbit_v2.build.f_cpu=64000000
microbit_v2.build.board=BBC_MICROBIT_V2
microbit_v2.build.core=microbit
microbit_v2.build.variant=bbcmicrobitv2

microbit_v2.program.tool=openocd
microbit_v2.program.tool.default=openocd
microbit_v2.program.protocol=cmsis-dap
microbit_v2.program.target=nrf52

microbit_v2.upload.tool=openocd
microbit_v2.upload.tool.default=openocd
microbit_v2.upload.protocol=cmsis-dap
microbit_v2.upload.native_usb=false
microbit_v2.upload.wait_for_upload_port=false
microbit_v2.upload.use_1200bps_touch=false

####################
# BBC micro:bit V1 #
####################
# This one will likely not work for a while
microbit_v1.name=BBC micro:bit V1

microbit_v1.vid.0=0x0d28
microbit_v1.pid.0=0x0204

microbit_v1.build.mcu=cortex-m0plus
microbit_v1.build.f_cpu=16000000
microbit_v1.build.board=BBC_MICROBIT_V1
microbit_v1.build.core=microbit
microbit_v1.build.variant=bbcmicrobitv1

microbit_v1.program.tool=openocd
microbit_v1.program.tool.default=openocd
microbit_v1.program.protocol=cmsis-dap
microbit_v1.program.target=nrf51

microbit_v1.upload.tool=openocd
microbit_v1.upload.tool.default=openocd
microbit_v1.upload.protocol=cmsis-dap
microbit_v1.upload.native_usb=false
microbit_v1.upload.wait_for_upload_port=false
microbit_v1.upload.use_1200bps_touch=false
